## Import Pandas

In [19]:
import pandas as pd

## Concatenate Dataset DataFrames

In [38]:
dataset1 = pd.DataFrame({'Age': ['32', '26', '29'],
                         'Sex': ['F', 'M', 'F'],
                         'State': ['CA', 'NY', 'OH']},
                         index=['Jane', 'John', 'Cathy'])
    
dataset2 = pd.DataFrame({'Age': ['34', '23', '24', '21'],
                         'Sex': ['M', 'F', 'F', 'F'],
                         'State': ['AZ', 'OR', 'CA', 'WA']},
                         index=['Dave', 'Kris', 'Xi', 'Jo'])

In [39]:
pd.concat([dataset1, dataset2])

      Age Sex State
Jane   32   F    CA
John   26   M    NY
Cathy  29   F    OH
Dave   34   M    AZ
Kris   23   F    OR
Xi     24   F    CA
Jo     21   F    WA

## Concatenate using append()

In [32]:
dataset1.append(dataset2)

      Age Sex State
Jane   32   F    CA
John   26   M    NY
Cathy  29   F    OH
Dave   34   M    AZ
Kris   23   F    OR
Xi     24   F    CA
Jo     21   F    WA

## Concatenate on columns

In [40]:
dataset1 = pd.DataFrame({'Age': ['32', '26', '29'],
                         'Sex': ['F', 'M', 'F'],
                         'State': ['CA', 'NY', 'OH']},
                         index=['Jane', 'John', 'Cathy'])

dataset2 = pd.DataFrame({'City': ['SF', 'NY', 'Columbus'],
                         'Work Status': ['No', 'Yes', 'Yes']},
                         index=['Jane', 'John', 'Cathy'])

In [41]:
pd.concat([dataset1, dataset2], axis=1)

      Age Sex State      City Work Status
Jane   32   F    CA        SF          No
John   26   M    NY        NY         Yes
Cathy  29   F    OH  Columbus         Yes

### Merging DataFrames

In [20]:
dataset1 = pd.DataFrame({'Name': ['Jane', 'John', 'Cathy', 'Sarah'],
                         'Age': ['32', '26', '29', '23'],
                         'Sex': ['F', 'M', 'F', 'F'],
                         'State': ['CA', 'NY', 'OH', 'TX']})

dataset2 = pd.DataFrame({'Name': ['Jane', 'John', 'Cathy', 'Rob'],
                        'City': ['SF', 'NY', 'Columbus', 'Austin'],
                         'Work Status': ['No', 'Yes', 'Yes', 'Yes']})

In [25]:
pd.merge(dataset1, dataset2, on='Name', how='inner')

  Age   Name Sex State      City Work Status
0  32   Jane   F    CA        SF          No
1  26   John   M    NY        NY         Yes
2  29  Cathy   F    OH  Columbus         Yes

### Left outer merge

In [26]:
pd.merge(dataset1, dataset2, on='Name', how='left')

  Age   Name Sex State      City Work Status
0  32   Jane   F    CA        SF          No
1  26   John   M    NY        NY         Yes
2  29  Cathy   F    OH  Columbus         Yes
3  23  Sarah   F    TX       NaN         NaN

### Right outer merge

In [27]:
pd.merge(dataset1, dataset2, on='Name', how='right')

   Age   Name  Sex State      City Work Status
0   32   Jane    F    CA        SF          No
1   26   John    M    NY        NY         Yes
2   29  Cathy    F    OH  Columbus         Yes
3  NaN    Rob  NaN   NaN    Austin         Yes

### Full outer merge

In [28]:
pd.merge(dataset1, dataset2, on='Name', how='outer')

   Age   Name  Sex State      City Work Status
0   32   Jane    F    CA        SF          No
1   26   John    M    NY        NY         Yes
2   29  Cathy    F    OH  Columbus         Yes
3   23  Sarah    F    TX       NaN         NaN
4  NaN    Rob  NaN   NaN    Austin         Yes